import streamlit as st

#ส่วนที่ 1 หัวข้อหน้าเว็บ ( title สีแดง )
st.markdown("# :red[🏋️ คำนวณค่าดัชณีมวลกาย BMI]")
st.write("กรอกข้อมูลน้ำหนักและส่วนสูงของคุณ เพื่อเช็กสุขภาพเบื้องต้น")

#ส่วนที่ 2 สร้างช่องเพื่อรับน้ำหนัก และส่วนสูง
weight = st.number_input("กรอกน้ำหนักของคุณ (กิโลกรัม):", min_value=1.0, value=1.0)
height_cm = st.number_input("กรอกส่วนสูงของคุณ (เซนติเมตร):", min_value=1.0, value=1.0)

#ส่วน 3 สร้างปุ่มกดคำนวณ
if st.button("คำนวณค่า BMI🩺"):
   # แปลงส่วนสูงจาก cm เป็น เมตร แล้วคำนวณ BMI
   height_m = height_cm / 100
  bmi = weight / (height_m **2) 

 st.write("---")
 st.header(f"ค่า BMI ของคุณคือ: **{bmi: .2f}**")

# ส่วน4 แปรผลค่าbmi
if bmi < 18.5:
   st.warning("คุณมีน้ำหนักน้อยกว่าเกณฑ์ (ผอม)")
elif 18.5 <= bmi < 23.0:
   st.success("คุณมีน้ำหนักในเกณฑ์ปกติ (สุขภาพดี)")
 elif 23.0 <= bmi < 25.0:
   st.info("คุณเริ่มมีน้ำหนักเกินเกณฑ์ (ท้วม)")
  elif:
   st.error("คุณอยู่ในเกณฑ์อ้วน ควรระวังเรื่องสุขภาพและออกกำลังกาย")

st.divider()
st.write("นางสาวพัตรพิมล เงินสุข ม.4/9 เลขที่42")
